---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TrussFailures.RemoveTrussSketch
source: html/d9d159c0-0aed-af88-b46e-2a6fd251fb13.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures.RemoveTrussSketch Property

Remove Sketch

## Syntax (C#)
```csharp
public static FailureDefinitionId RemoveTrussSketch { get; }
```